/* automatically generated by rust-bindgen 0.59.2 */

/* Copyright (c), Firelight Technologies Pty, Ltd. 2004-2022. */

#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct FMOD_STUDIO_SYSTEM {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct FMOD_STUDIO_EVENTDESCRIPTION {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct FMOD_STUDIO_EVENTINSTANCE {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct FMOD_STUDIO_BUS {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct FMOD_STUDIO_VCA {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct FMOD_STUDIO_BANK {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct FMOD_STUDIO_COMMANDREPLAY {
    _unused: [u8; 0],
}
pub type FMOD_STUDIO_INITFLAGS = ::std::os::raw::c_uint;
pub type FMOD_STUDIO_PARAMETER_FLAGS = ::std::os::raw::c_uint;
pub type FMOD_STUDIO_SYSTEM_CALLBACK_TYPE = ::std::os::raw::c_uint;
pub type FMOD_STUDIO_EVENT_CALLBACK_TYPE = ::std::os::raw::c_uint;
pub type FMOD_STUDIO_LOAD_BANK_FLAGS = ::std::os::raw::c_uint;
pub type FMOD_STUDIO_COMMANDCAPTURE_FLAGS = ::std::os::raw::c_uint;
pub type FMOD_STUDIO_COMMANDREPLAY_FLAGS = ::std::os::raw::c_uint;
pub const FMOD_STUDIO_LOADING_STATE_UNLOADING: FMOD_STUDIO_LOADING_STATE = 0;
pub const FMOD_STUDIO_LOADING_STATE_UNLOADED: FMOD_STUDIO_LOADING_STATE = 1;
pub const FMOD_STUDIO_LOADING_STATE_LOADING: FMOD_STUDIO_LOADING_STATE = 2;

pub const FMOD_STUDIO_USER_PROPERTY_TYPE_FORCEINT: FMOD_STUDIO_USER_PROPERTY_TYPE = 65536;
pub type FMOD_STUDIO_USER_PROPERTY_TYPE = ::std::os::raw::c_int;
pub const FMOD_STUDIO_EVENT_PROPERTY_CHANNELPRIORITY: FMOD_STUDIO_EVENT_PROPERTY = 0;
pub const FMOD_STUDIO_EVENT_PROPERTY_SCHEDULE_DELAY: FMOD_STUDIO_EVENT_PROPERTY = 1;
pub const FMOD_STUDIO_EVENT_PROPERTY_SCHEDULE_LOOKAHEAD: FMOD_STUDIO_EVENT_PROPERTY = 2;
pub const FMOD_STUDIO_EVENT_PROPERTY_MINIMUM_DISTANCE: FMOD_STUDIO_EVENT_PROPERTY = 3;
pub const FMOD_STUDIO_EVENT_PROPERTY_MAXIMUM_DISTANCE: FMOD_STUDIO_EVENT_PROPERTY = 4;
pub const FMOD_STUDIO_EVENT_PROPERTY_COOLDOWN: FMOD_STUDIO_EVENT_PROPERTY = 5;
pub const FMOD_STUDIO_EVENT_PROPERTY_MAX: FMOD_STUDIO_EVENT_PROPERTY = 6;
pub const FMOD_STUDIO_EVENT_PROPERTY_FORCEINT: FMOD_STUDIO_EVENT_PROPERTY = 65536;
pub type FMOD_STUDIO_EVENT_PROPERTY = ::std::os::raw::c_int;
pub const FMOD_STUDIO_PLAYBACK_PLAYING: FMOD_STUDIO_PLAYBACK_STATE = 0;
pub const FMOD_STUDIO_PLAYBACK_SUSTAINING: FMOD_STUDIO_PLAYBACK_STATE = 1;
pub const FMOD_STUDIO_PLAYBACK_STOPPED: FMOD_STUDIO_PLAYBACK_STATE = 2;
pub const FMOD_STUDIO_PLAYBACK_STARTING: FMOD_STUDIO_PLAYBACK_STATE = 3;
pub const FMOD_STUDIO_PLAYBACK_STOPPING: FMOD_STUDIO_PLAYBACK_STATE = 4;
pub const FMOD_STUDIO_PLAYBACK_FORCEINT: FMOD_STUDIO_PLAYBACK_STATE = 65536;
pub type FMOD_STUDIO_PLAYBACK_STATE = ::std::os::raw::c_int;
pub const FMOD_STUDIO_STOP_ALLOWFADEOUT: FMOD_STUDIO_STOP_MODE = 0;
pub const FMOD_STUDIO_STOP_IMMEDIATE: FMOD_STUDIO_STOP_MODE = 1;
pub const FMOD_STUDIO_STOP_FORCEINT: FMOD_STUDIO_STOP_MODE = 65536;
pub type FMOD_STUDIO_STOP_MODE = ::std::os::raw::c_int;
pub const FMOD_STUDIO_INSTANCETYPE_NONE: FMOD_STUDIO_INSTANCETYPE = 0;
pub const FMOD_STUDIO_INSTANCETYPE_SYSTEM: FMOD_STUDIO_INSTANCETYPE = 1;
pub const FMOD_STUDIO_INSTANCETYPE_EVENTDESCRIPTION: FMOD_STUDIO_INSTANCETYPE = 2;
pub const FMOD_STUDIO_INSTANCETYPE_EVENTINSTANCE: FMOD_STUDIO_INSTANCETYPE = 3;
pub const FMOD_STUDIO_INSTANCETYPE_PARAMETERINSTANCE: FMOD_STUDIO_INSTANCETYPE = 4;
pub const FMOD_STUDIO_INSTANCETYPE_BUS: FMOD_STUDIO_INSTANCETYPE = 5;
pub const FMOD_STUDIO_INSTANCETYPE_VCA: FMOD_STUDIO_INSTANCETYPE = 6;
pub const FMOD_STUDIO_INSTANCETYPE_BANK: FMOD_STUDIO_INSTANCETYPE = 7;
pub const FMOD_STUDIO_INSTANCETYPE_COMMANDREPLAY: FMOD_STUDIO_INSTANCETYPE = 8;
pub const FMOD_STUDIO_INSTANCETYPE_FORCEINT: FMOD_STUDIO_INSTANCETYPE = 65536;
pub type FMOD_STUDIO_INSTANCETYPE = ::std::os::raw::c_int;
#[repr(C)]
// #[derive(Debug)] // rust-lang/rust#96513
#[derive(Copy, Clone)]
pub struct FMOD_STUDIO_BANK_INFO {
    pub size: ::std::os::raw::c_int,
    pub userdata: *mut ::std::os::raw::c_void,
    pub userdatalength: ::std::os::raw::c_int,
    pub opencallback: FMOD_FILE_OPEN_CALLBACK,
    pub closecallback: FMOD_FILE_CLOSE_CALLBACK,
    pub readcallback: FMOD_FILE_READ_CALLBACK,
    pub seekcallback: FMOD_FILE_SEEK_CALLBACK,
}
#[test]
fn bindgen_test_layout_FMOD_STUDIO_BANK_INFO() {
    assert_eq!(
        ::std::mem::size_of::<FMOD_STUDIO_BANK_INFO>(),
        56usize,
        concat!("Size of: ", stringify!(FMOD_STUDIO_BANK_INFO))
    );
    assert_eq!(
        ::std::mem::align_of::<FMOD_STUDIO_BANK_INFO>(),
        8usize,
        concat!("Alignment of ", stringify!(FMOD_STUDIO_BANK_INFO))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<FMOD_STUDIO_BANK_INFO>())).size as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(FMOD_STUDIO_BANK_INFO),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<FMOD_STUDIO_BANK_INFO>())).userdata as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(FMOD_STUDIO_BANK_INFO),
            "::",
            stringify!(userdata)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<FMOD_STUDIO_BANK_INFO>())).userdatalength as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(FMOD_STUDIO_BANK_INFO),
            "::",
            stringify!(userdatalength)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<FMOD_STUDIO_BANK_INFO>())).opencallback as *const _ as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(FMOD_STUDIO_BANK_INFO),
            "::",
            stringify!(opencallback)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<FMOD_STUDIO_BANK_INFO>())).closecallback as *const _ as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(FMOD_STUDIO_BANK_INFO),
            "::",
            stringify!(closecallback)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<FMOD_STUDIO_BANK_INFO>())).readcallback as *const _ as usize
        },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(FMOD_STUDIO_BANK_INFO),
            "::",
            stringify!(readcallback)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<FMOD_STUDIO_BANK_INFO>())).seekcallback as *const _ as usize
        },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(FMOD_STUDIO_BANK_INFO),
            "::",
            stringify!(seekcallback)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct FMOD_STUDIO_PARAMETER_ID {
    pub data1: ::std::os::raw::c_uint,
    pub data2: ::std::os::raw::c_uint,
}
#[test]
fn bindgen_test_layout_FMOD_STUDIO_PARAMETER_ID() {
    assert_eq!(
        ::std::mem::size_of::<FMOD_STUDIO_PARAMETER_ID>(),
        8usize,
        concat!("Size of: ", stringify!(FMOD_STUDIO_PARAMETER_ID))
    );
    assert_eq!(
        ::std::mem::align_of::<FMOD_STUDIO_PARAMETER_ID>(),
        4usize,
        concat!("Alignment of ", stringify!(FMOD_STUDIO_PARAMETER_ID))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<FMOD_STUDIO_PARAMETER_ID>())).data1 as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(FMOD_STUDIO_PARAMETER_ID),
            "::",
            stringify!(data1)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<FMOD_STUDIO_PARAMETER_ID>())).data2 as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(FMOD_STUDIO_PARAMETER_ID),
            "::",
            stringify!(data2)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct FMOD_STUDIO_PARAMETER_DESCRIPTION {
    pub name: *const ::std::os::raw::c_char,
    pub id: FMOD_STUDIO_PARAMETER_ID,
    pub minimum: f32,
    pub maximum: f32,
    pub defaultvalue: f32,
    pub type_: FMOD_STUDIO_PARAMETER_TYPE,
    pub flags: FMOD_STUDIO_PARAMETER_FLAGS,
    pub guid: FMOD_GUID,
}
#[test]
fn bindgen_test_layout_FMOD_STUDIO_PARAMETER_DESCRIPTION() {
    assert_eq!(
        ::std::mem::size_of::<FMOD_STUDIO_PARAMETER_DESCRIPTION>(),
        56usize,
        concat!("Size of: ", stringify!(FMOD_STUDIO_PARAMETER_DESCRIPTION))
    );
    assert_eq!(
        ::std::mem::align_of::<FMOD_STUDIO_PARAMETER_DESCRIPTION>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(FMOD_STUDIO_PARAMETER_DESCRIPTION)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<FMOD_STUDIO_PARAMETER_DESCRIPTION>())).name as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(FMOD_STUDIO_PARAMETER_DESCRIPTION),
            "::",
            stringify!(name)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<FMOD_STUDIO_PARAMETER_DESCRIPTION>())).id as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(FMOD_STUDIO_PARAMETER_DESCRIPTION),
            "::",
            stringify!(id)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<FMOD_STUDIO_PARAMETER_DESCRIPTION>())).minimum as *const _
                as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(FMOD_STUDIO_PARAMETER_DESCRIPTION),
            "::",
            stringify!(minimum)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<FMOD_STUDIO_PARAMETER_DESCRIPTION>())).maximum as *const _
                as usize
        },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(FMOD_STUDIO_PARAMETER_DESCRIPTION),
            "::",
            stringify!(maximum)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<FMOD_STUDIO_PARAMETER_DESCRIPTION>())).defaultvalue as *const _
                as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(FMOD_STUDIO_PARAMETER_DESCRIPTION),
            "::",
            stringify!(defaultvalue)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<FMOD_STUDIO_PARAMETER_DESCRIPTION>())).type_ as *const _ as usize
        },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(FMOD_STUDIO_PARAMETER_DESCRIPTION),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<FMOD_STUDIO_PARAMETER_DESCRIPTION>())).flags as *const _ as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(FMOD_STUDIO_PARAMETER_DESCRIPTION),
            "::",
            stringify!(flags)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<FMOD_STUDIO_PARAMETER_DESCRIPTION>())).guid as *const _ as usize
        },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(FMOD_STUDIO_PARAMETER_DESCRIPTION),
            "::",
            stringify!(guid)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct FMOD_STUDIO_USER_PROPERTY {
    pub name: *const ::std::os::raw::c_char,
    pub type_: FMOD_STUDIO_USER_PROPERTY_TYPE,
    pub __bindgen_anon_1: FMOD_STUDIO_USER_PROPERTY__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union FMOD_STUDIO_USER_PROPERTY__bindgen_ty_1 {
    pub intvalue: ::std::os::raw::c_int,
    pub boolvalue: FMOD_BOOL,
    pub floatvalue: f32,
    pub stringvalue: *const ::std::os::raw::c_char,
}
#[test]
fn bindgen_test_layout_FMOD_STUDIO_USER_PROPERTY__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<FMOD_STUDIO_USER_PROPERTY__bindgen_ty_1>(),
        8usize,
        concat!(
            "Size of: ",
            stringify!(FMOD_STUDIO_USER_PROPERTY__bindgen_ty_1)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<FMOD_STUDIO_USER_PROPERTY__bindgen_ty_1>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(FMOD_STUDIO_USER_PROPERTY__bindgen_ty_1)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<FMOD_STUDIO_USER_PROPERTY__bindgen_ty_1>())).intvalue as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(FMOD_STUDIO_USER_PROPERTY__bindgen_ty_1),
            "::",
            stringify!(intvalue)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<FMOD_STUDIO_USER_PROPERTY__bindgen_ty_1>())).boolvalue
                as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(FMOD_STUDIO_USER_PROPERTY__bindgen_ty_1),
            "::",
            stringify!(boolvalue)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<FMOD_STUDIO_USER_PROPERTY__bindgen_ty_1>())).floatvalue
                as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(FMOD_STUDIO_USER_PROPERTY__bindgen_ty_1),
            "::",
            stringify!(floatvalue)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<FMOD_STUDIO_USER_PROPERTY__bindgen_ty_1>())).stringvalue
                as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(FMOD_STUDIO_USER_PROPERTY__bindgen_ty_1),
            "::",
            stringify!(stringvalue)
        )
    );
}
#[test]
fn bindgen_test_layout_FMOD_STUDIO_USER_PROPERTY() {
    assert_eq!(
        ::std::mem::size_of::<FMOD_STUDIO_USER_PROPERTY>(),
        24usize,
        concat!("Size of: ", stringify!(FMOD_STUDIO_USER_PROPERTY))
    );
    assert_eq!(
        ::std::mem::align_of::<FMOD_STUDIO_USER_PROPERTY>(),
        8usize,
        concat!("Alignment of ", stringify!(FMOD_STUDIO_USER_PROPERTY))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<FMOD_STUDIO_USER_PROPERTY>())).name as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(FMOD_STUDIO_USER_PROPERTY),
            "::",
            stringify!(name)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<FMOD_STUDIO_USER_PROPERTY>())).type_ as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(FMOD_STUDIO_USER_PROPERTY),
            "::",
            stringify!(type_)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct FMOD_STUDIO_PROGRAMMER_SOUND_PROPERTIES {
    pub name: *const ::std::os::raw::c_char,
    pub sound: *mut FMOD_SOUND,
    pub subsoundIndex: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_FMOD_STUDIO_PROGRAMMER_SOUND_PROPERTIES() {
    assert_eq!(
        ::std::mem::size_of::<FMOD_STUDIO_PROGRAMMER_SOUND_PROPERTIES>(),
        24usize,
        concat!(
            "Size of: ",
            stringify!(FMOD_STUDIO_PROGRAMMER_SOUND_PROPERTIES)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<FMOD_STUDIO_PROGRAMMER_SOUND_PROPERTIES>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(FMOD_STUDIO_PROGRAMMER_SOUND_PROPERTIES)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<FMOD_STUDIO_PROGRAMMER_SOUND_PROPERTIES>())).name as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(FMOD_STUDIO_PROGRAMMER_SOUND_PROPERTIES),
            "::",
            stringify!(name)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<FMOD_STUDIO_PROGRAMMER_SOUND_PROPERTIES>())).sound as *const _
                as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(FMOD_STUDIO_PROGRAMMER_SOUND_PROPERTIES),
            "::",
            stringify!(sound)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<FMOD_STUDIO_PROGRAMMER_SOUND_PROPERTIES>())).subsoundIndex
                as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(FMOD_STUDIO_PROGRAMMER_SOUND_PROPERTIES),
            "::",
            stringify!(subsoundIndex)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct FMOD_STUDIO_PLUGIN_INSTANCE_PROPERTIES {
    pub name: *const ::std::os::raw::c_char,
    pub dsp: *mut FMOD_DSP,
}
#[test]
fn bindgen_test_layout_FMOD_STUDIO_PLUGIN_INSTANCE_PROPERTIES() {
    assert_eq!(
        ::std::mem::size_of::<FMOD_STUDIO_PLUGIN_INSTANCE_PROPERTIES>(),
        16usize,
        concat!(
            "Size of: ",
            stringify!(FMOD_STUDIO_PLUGIN_INSTANCE_PROPERTIES)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<FMOD_STUDIO_PLUGIN_INSTANCE_PROPERTIES>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(FMOD_STUDIO_PLUGIN_INSTANCE_PROPERTIES)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<FMOD_STUDIO_PLUGIN_INSTANCE_PROPERTIES>())).name as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(FMOD_STUDIO_PLUGIN_INSTANCE_PROPERTIES),
            "::",
            stringify!(name)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<FMOD_STUDIO_PLUGIN_INSTANCE_PROPERTIES>())).dsp as *const _
                as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(FMOD_STUDIO_PLUGIN_INSTANCE_PROPERTIES),
            "::",
            stringify!(dsp)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct FMOD_STUDIO_TIMELINE_MARKER_PROPERTIES {
    pub name: *const ::std::os::raw::c_char,
    pub position: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_FMOD_STUDIO_TIMELINE_MARKER_PROPERTIES() {
    assert_eq!(
        ::std::mem::size_of::<FMOD_STUDIO_TIMELINE_MARKER_PROPERTIES>(),
        16usize,
        concat!(
            "Size of: ",
            stringify!(FMOD_STUDIO_TIMELINE_MARKER_PROPERTIES)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<FMOD_STUDIO_TIMELINE_MARKER_PROPERTIES>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(FMOD_STUDIO_TIMELINE_MARKER_PROPERTIES)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<FMOD_STUDIO_TIMELINE_MARKER_PROPERTIES>())).name as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(FMOD_STUDIO_TIMELINE_MARKER_PROPERTIES),
            "::",
            stringify!(name)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<FMOD_STUDIO_TIMELINE_MARKER_PROPERTIES>())).position as *const _
                as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(FMOD_STUDIO_TIMELINE_MARKER_PROPERTIES),
            "::",
            stringify!(position)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct FMOD_STUDIO_TIMELINE_BEAT_PROPERTIES {
    pub bar: ::std::os::raw::c_int,
    pub beat: ::std::os::raw::c_int,
    pub position: ::std::os::raw::c_int,
    pub tempo: f32,
    pub timesignatureupper: ::std::os::raw::c_int,
    pub timesignaturelower: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_FMOD_STUDIO_TIMELINE_BEAT_PROPERTIES() {
    assert_eq!(
        ::std::mem::size_of::<FMOD_STUDIO_TIMELINE_BEAT_PROPERTIES>(),
        24usize,
        concat!(
            "Size of: ",
            stringify!(FMOD_STUDIO_TIMELINE_BEAT_PROPERTIES)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<FMOD_STUDIO_TIMELINE_BEAT_PROPERTIES>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(FMOD_STUDIO_TIMELINE_BEAT_PROPERTIES)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<FMOD_STUDIO_TIMELINE_BEAT_PROPERTIES>())).bar as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(FMOD_STUDIO_TIMELINE_BEAT_PROPERTIES),
            "::",
            stringify!(bar)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<FMOD_STUDIO_TIMELINE_BEAT_PROPERTIES>())).beat as *const _
                as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(FMOD_STUDIO_TIMELINE_BEAT_PROPERTIES),
            "::",
            stringify!(beat)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<FMOD_STUDIO_TIMELINE_BEAT_PROPERTIES>())).position as *const _
                as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(FMOD_STUDIO_TIMELINE_BEAT_PROPERTIES),
            "::",
            stringify!(position)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<FMOD_STUDIO_TIMELINE_BEAT_PROPERTIES>())).tempo as *const _
                as usize
        },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(FMOD_STUDIO_TIMELINE_BEAT_PROPERTIES),
            "::",
            stringify!(tempo)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<FMOD_STUDIO_TIMELINE_BEAT_PROPERTIES>())).timesignatureupper
                as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(FMOD_STUDIO_TIMELINE_BEAT_PROPERTIES),
            "::",
            stringify!(timesignatureupper)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<FMOD_STUDIO_TIMELINE_BEAT_PROPERTIES>())).timesignaturelower
                as *const _ as usize
        },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(FMOD_STUDIO_TIMELINE_BEAT_PROPERTIES),
            "::",
            stringify!(timesignaturelower)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct FMOD_STUDIO_TIMELINE_NESTED_BEAT_PROPERTIES {
    pub eventid: FMOD_GUID,
    pub properties: FMOD_STUDIO_TIMELINE_BEAT_PROPERTIES,
}
#[test]
fn bindgen_test_layout_FMOD_STUDIO_TIMELINE_NESTED_BEAT_PROPERTIES() {
    assert_eq!(
        ::std::mem::size_of::<FMOD_STUDIO_TIMELINE_NESTED_BEAT_PROPERTIES>(),
        40usize,
        concat!(
            "Size of: ",
            stringify!(FMOD_STUDIO_TIMELINE_NESTED_BEAT_PROPERTIES)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<FMOD_STUDIO_TIMELINE_NESTED_BEAT_PROPERTIES>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(FMOD_STUDIO_TIMELINE_NESTED_BEAT_PROPERTIES)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<FMOD_STUDIO_TIMELINE_NESTED_BEAT_PROPERTIES>())).eventid
                as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(FMOD_STUDIO_TIMELINE_NESTED_BEAT_PROPERTIES),
            "::",
            stringify!(eventid)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<FMOD_STUDIO_TIMELINE_NESTED_BEAT_PROPERTIES>())).properties
                as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(FMOD_STUDIO_TIMELINE_NESTED_BEAT_PROPERTIES),
            "::",
            stringify!(properties)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct FMOD_STUDIO_ADVANCEDSETTINGS {
    pub cbsize: ::std::os::raw::c_int,
    pub commandqueuesize: ::std::os::raw::c_uint,
    pub handleinitialsize: ::std::os::raw::c_uint,
    pub studioupdateperiod: ::std::os::raw::c_int,
    pub idlesampledatapoolsize: ::std::os::raw::c_int,
    pub streamingscheduledelay: ::std::os::raw::c_uint,
    pub encryptionkey: *const ::std::os::raw::c_char,
}
#[test]
fn bindgen_test_layout_FMOD_STUDIO_ADVANCEDSETTINGS() {
    assert_eq!(
        ::std::mem::size_of::<FMOD_STUDIO_ADVANCEDSETTINGS>(),
        32usize,
        concat!("Size of: ", stringify!(FMOD_STUDIO_ADVANCEDSETTINGS))
    );
    assert_eq!(
        ::std::mem::align_of::<FMOD_STUDIO_ADVANCEDSETTINGS>(),
        8usize,
        concat!("Alignment of ", stringify!(FMOD_STUDIO_ADVANCEDSETTINGS))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<FMOD_STUDIO_ADVANCEDSETTINGS>())).cbsize as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(FMOD_STUDIO_ADVANCEDSETTINGS),
            "::",
            stringify!(cbsize)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<FMOD_STUDIO_ADVANCEDSETTINGS>())).commandqueuesize as *const _
                as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(FMOD_STUDIO_ADVANCEDSETTINGS),
            "::",
            stringify!(commandqueuesize)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<FMOD_STUDIO_ADVANCEDSETTINGS>())).handleinitialsize as *const _
                as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(FMOD_STUDIO_ADVANCEDSETTINGS),
            "::",
            stringify!(handleinitialsize)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<FMOD_STUDIO_ADVANCEDSETTINGS>())).studioupdateperiod as *const _
                as usize
        },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(FMOD_STUDIO_ADVANCEDSETTINGS),
            "::",
            stringify!(studioupdateperiod)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<FMOD_STUDIO_ADVANCEDSETTINGS>())).idlesampledatapoolsize
                as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(FMOD_STUDIO_ADVANCEDSETTINGS),
            "::",
            stringify!(idlesampledatapoolsize)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<FMOD_STUDIO_ADVANCEDSETTINGS>())).streamingscheduledelay
                as *const _ as usize
        },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(FMOD_STUDIO_ADVANCEDSETTINGS),
            "::",
            stringify!(streamingscheduledelay)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<FMOD_STUDIO_ADVANCEDSETTINGS>())).encryptionkey as *const _
                as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(FMOD_STUDIO_ADVANCEDSETTINGS),
            "::",
            stringify!(encryptionkey)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct FMOD_STUDIO_CPU_USAGE {
    pub update: f32,
}
#[test]
fn bindgen_test_layout_FMOD_STUDIO_CPU_USAGE() {
    assert_eq!(
        ::std::mem::size_of::<FMOD_STUDIO_CPU_USAGE>(),
        4usize,
        concat!("Size of: ", stringify!(FMOD_STUDIO_CPU_USAGE))
    );
    assert_eq!(
        ::std::mem::align_of::<FMOD_STUDIO_CPU_USAGE>(),
        4usize,
        concat!("Alignment of ", stringify!(FMOD_STUDIO_CPU_USAGE))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<FMOD_STUDIO_CPU_USAGE>())).update as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(FMOD_STUDIO_CPU_USAGE),
            "::",
            stringify!(update)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct FMOD_STUDIO_BUFFER_INFO {
    pub currentusage: ::std::os::raw::c_int,
    pub peakusage: ::std::os::raw::c_int,
    pub capacity: ::std::os::raw::c_int,
    pub stallcount: ::std::os::raw::c_int,
    pub stalltime: f32,
}
#[test]
fn bindgen_test_layout_FMOD_STUDIO_BUFFER_INFO() {
    assert_eq!(
        ::std::mem::size_of::<FMOD_STUDIO_BUFFER_INFO>(),
        20usize,
        concat!("Size of: ", stringify!(FMOD_STUDIO_BUFFER_INFO))
    );
    assert_eq!(
        ::std::mem::align_of::<FMOD_STUDIO_BUFFER_INFO>(),
        4usize,
        concat!("Alignment of ", stringify!(FMOD_STUDIO_BUFFER_INFO))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<FMOD_STUDIO_BUFFER_INFO>())).currentusage as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(FMOD_STUDIO_BUFFER_INFO),
            "::",
            stringify!(currentusage)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<FMOD_STUDIO_BUFFER_INFO>())).peakusage as *const _ as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(FMOD_STUDIO_BUFFER_INFO),
            "::",
            stringify!(peakusage)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<FMOD_STUDIO_BUFFER_INFO>())).capacity as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(FMOD_STUDIO_BUFFER_INFO),
            "::",
            stringify!(capacity)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<FMOD_STUDIO_BUFFER_INFO>())).stallcount as *const _ as usize
        },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(FMOD_STUDIO_BUFFER_INFO),
            "::",
            stringify!(stallcount)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<FMOD_STUDIO_BUFFER_INFO>())).stalltime as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(FMOD_STUDIO_BUFFER_INFO),
            "::",
            stringify!(stalltime)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct FMOD_STUDIO_BUFFER_USAGE {
    pub studiocommandqueue: FMOD_STUDIO_BUFFER_INFO,
    pub studiohandle: FMOD_STUDIO_BUFFER_INFO,
}
#[test]
fn bindgen_test_layout_FMOD_STUDIO_BUFFER_USAGE() {
    assert_eq!(
        ::std::mem::size_of::<FMOD_STUDIO_BUFFER_USAGE>(),
        40usize,
        concat!("Size of: ", stringify!(FMOD_STUDIO_BUFFER_USAGE))
    );
    assert_eq!(
        ::std::mem::align_of::<FMOD_STUDIO_BUFFER_USAGE>(),
        4usize,
        concat!("Alignment of ", stringify!(FMOD_STUDIO_BUFFER_USAGE))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<FMOD_STUDIO_BUFFER_USAGE>())).studiocommandqueue as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(FMOD_STUDIO_BUFFER_USAGE),
            "::",
            stringify!(studiocommandqueue)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<FMOD_STUDIO_BUFFER_USAGE>())).studiohandle as *const _ as usize
        },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(FMOD_STUDIO_BUFFER_USAGE),
            "::",
            stringify!(studiohandle)
        )
    );
}
#[repr(C)]
// #[derive(Debug)] // rust-lang/rust#96513
#[derive(Copy, Clone)]
pub struct FMOD_STUDIO_SOUND_INFO {
    pub name_or_data: *const ::std::os::raw::c_char,
    pub mode: FMOD_MODE,
    pub exinfo: FMOD_CREATESOUNDEXINFO,
    pub subsoundindex: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_FMOD_STUDIO_SOUND_INFO() {
    assert_eq!(
        ::std::mem::size_of::<FMOD_STUDIO_SOUND_INFO>(),
        248usize,
        concat!("Size of: ", stringify!(FMOD_STUDIO_SOUND_INFO))
    );
    assert_eq!(
        ::std::mem::align_of::<FMOD_STUDIO_SOUND_INFO>(),
        8usize,
        concat!("Alignment of ", stringify!(FMOD_STUDIO_SOUND_INFO))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<FMOD_STUDIO_SOUND_INFO>())).name_or_data as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(FMOD_STUDIO_SOUND_INFO),
            "::",
            stringify!(name_or_data)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<FMOD_STUDIO_SOUND_INFO>())).mode as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(FMOD_STUDIO_SOUND_INFO),
            "::",
            stringify!(mode)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<FMOD_STUDIO_SOUND_INFO>())).exinfo as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(FMOD_STUDIO_SOUND_INFO),
            "::",
            stringify!(exinfo)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<FMOD_STUDIO_SOUND_INFO>())).subsoundindex as *const _ as usize
        },
        240usize,
        concat!(
            "Offset of field: ",
            stringify!(FMOD_STUDIO_SOUND_INFO),
            "::",
            stringify!(subsoundindex)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct FMOD_STUDIO_COMMAND_INFO {
    pub commandname: *const ::std::os::raw::c_char,
    pub parentcommandindex: ::std::os::raw::c_int,
    pub framenumber: ::std::os::raw::c_int,
    pub frametime: f32,
    pub instancetype: FMOD_STUDIO_INSTANCETYPE,
    pub outputtype: FMOD_STUDIO_INSTANCETYPE,
    pub instancehandle: ::std::os::raw::c_uint,
    pub outputhandle: ::std::os::raw::c_uint,
}
#[test]
fn bindgen_test_layout_FMOD_STUDIO_COMMAND_INFO() {
    assert_eq!(
        ::std::mem::size_of::<FMOD_STUDIO_COMMAND_INFO>(),
        40usize,
        concat!("Size of: ", stringify!(FMOD_STUDIO_COMMAND_INFO))
    );
    assert_eq!(
        ::std::mem::align_of::<FMOD_STUDIO_COMMAND_INFO>(),
        8usize,
        concat!("Alignment of ", stringify!(FMOD_STUDIO_COMMAND_INFO))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<FMOD_STUDIO_COMMAND_INFO>())).commandname as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(FMOD_STUDIO_COMMAND_INFO),
            "::",
            stringify!(commandname)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<FMOD_STUDIO_COMMAND_INFO>())).parentcommandindex as *const _
                as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(FMOD_STUDIO_COMMAND_INFO),
            "::",
            stringify!(parentcommandindex)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<FMOD_STUDIO_COMMAND_INFO>())).framenumber as *const _ as usize
        },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(FMOD_STUDIO_COMMAND_INFO),
            "::",
            stringify!(framenumber)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<FMOD_STUDIO_COMMAND_INFO>())).frametime as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(FMOD_STUDIO_COMMAND_INFO),
            "::",
            stringify!(frametime)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<FMOD_STUDIO_COMMAND_INFO>())).instancetype as *const _ as usize
        },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(FMOD_STUDIO_COMMAND_INFO),
            "::",
            stringify!(instancetype)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<FMOD_STUDIO_COMMAND_INFO>())).outputtype as *const _ as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(FMOD_STUDIO_COMMAND_INFO),
            "::",
            stringify!(outputtype)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<FMOD_STUDIO_COMMAND_INFO>())).instancehandle as *const _ as usize
        },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(FMOD_STUDIO_COMMAND_INFO),
            "::",
            stringify!(instancehandle)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<FMOD_STUDIO_COMMAND_INFO>())).outputhandle as *const _ as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(FMOD_STUDIO_COMMAND_INFO),
            "::",
            stringify!(outputhandle)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct FMOD_STUDIO_MEMORY_USAGE {
    pub exclusive: ::std::os::raw::c_int,
    pub inclusive: ::std::os::raw::c_int,
    pub sampledata: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_FMOD_STUDIO_MEMORY_USAGE() {
    assert_eq!(
        ::std::mem::size_of::<FMOD_STUDIO_MEMORY_USAGE>(),
        12usize,
        concat!("Size of: ", stringify!(FMOD_STUDIO_MEMORY_USAGE))
    );
    assert_eq!(
        ::std::mem::align_of::<FMOD_STUDIO_MEMORY_USAGE>(),
        4usize,
        concat!("Alignment of ", stringify!(FMOD_STUDIO_MEMORY_USAGE))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<FMOD_STUDIO_MEMORY_USAGE>())).exclusive as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(FMOD_STUDIO_MEMORY_USAGE),
            "::",
            stringify!(exclusive)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<FMOD_STUDIO_MEMORY_USAGE>())).inclusive as *const _ as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(FMOD_STUDIO_MEMORY_USAGE),
            "::",
            stringify!(inclusive)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<FMOD_STUDIO_MEMORY_USAGE>())).sampledata as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(FMOD_STUDIO_MEMORY_USAGE),
            "::",
            stringify!(sampledata)
        )
    );
}
pub type FMOD_STUDIO_SYSTEM_CALLBACK = ::std::option::Option<
    unsafe extern "system" fn(
        system: *mut FMOD_STUDIO_SYSTEM,
        type_: FMOD_STUDIO_SYSTEM_CALLBACK_TYPE,
        commanddata: *mut ::std::os::raw::c_void,
        userdata: *mut ::std::os::raw::c_void,
    ) -> FMOD_RESULT,
>;
pub type FMOD_STUDIO_EVENT_CALLBACK = ::std::option::Option<
    unsafe extern "system" fn(
        type_: FMOD_STUDIO_EVENT_CALLBACK_TYPE,
        event: *mut FMOD_STUDIO_EVENTINSTANCE,
        parameters: *mut ::std::os::raw::c_void,
    ) -> FMOD_RESULT,
>;
pub type FMOD_STUDIO_COMMANDREPLAY_FRAME_CALLBACK = ::std::option::Option<
    unsafe extern "system" fn(
        replay: *mut FMOD_STUDIO_COMMANDREPLAY,
        commandindex: ::std::os::raw::c_int,
        currenttime: f32,
        userdata: *mut ::std::os::raw::c_void,
